parent('Борис Морозов', 'Артем Морозов').
parent('Ирина Тараканова', 'Артем Морозов').
parent('Вячеслав Тараканов', 'Ирина Тараканова').
parent('Татьяна Хомякова', 'Ирина Тараканова').
parent('Вячеслав Тараканов', 'Александр Тараканов').
parent('Татьяна Хомякова', 'Александр Тараканов').
parent('Лев Морозов', 'Борис Морозов').
parent('Валентина Пятова', 'Борис Морозов').
parent('Лев Морозов', 'Татьяна Морозова').
parent('Валентина Пятова', 'Татьяна Морозова').
parent('Лев Морозов', 'Анатолий Горшелев').
parent('Валентина Пятова', 'Анатолий Горшелев').
parent('Михаил Задонский', 'Станислав Задонский').
parent('Ирина Тараканова', 'Станислав Задонский').
parent('Александр Тараканов', 'Никита Тараканов').
parent('Светлана Анисимова', 'Никита Тараканов').
parent('Александр Тараканов', 'Кирилл Тараканов').
parent('Светлана Анисимова', 'Кирилл Тараканов').
parent('Алексей Горшелев', 'Максим Горшелев').
parent('Татьяна Морозова', 'Максим Горшелев').
parent('Алексей Горшелев', 'Елена Горшелева').
parent('Татьяна Морозова', 'Елена Горшелева').
parent('Сергей Кинжалов', 'Полина Кинжалова').
parent('Елена Горшелева', 'Полина Кинжалова').
parent('Павел Пятов', 'Валентина Пятова').
parent('Фёкла Тверская', 'Валентина Пятова').
parent('Павел Пятов', 'Анна Пятова').
parent('Фёкла Тверская', 'Анна Пятова').
parent('Петр Морозов', 'Лев Морозов').
parent('Анна Ивановская', 'Лев Морозов').
parent('Михаил Анисимов', 'Светлана Анисимова').
parent('Екатерина Першина', 'Светлана Анисимова').
parent('Олег Хомяков', 'Татьяна Хомякова').
parent('Полина Павликова', 'Татьяна Хомякова').
parent('Алексей Тараканов', 'Вячеслав Тараканов').
parent('Евгения Молчанова', 'Вячеслав Тараканов').
parent('Ольга Тверская', 'Сергей Тверской').
parent('Фёкла Тверская', 'Сергей Тверской').
sex('Борис Морозов', 'm').
sex('Ирина Тараканова', 'f').
sex('Артем Морозов', 'm').
sex('Татьяна Хомякова', 'f').
sex('Лев Морозов', 'm').
sex('Вячеслав Тараканов', 'm').
sex('Валентина Пятова', 'f').
sex('Михаил Задонский', 'm').
sex('Александр Тараканов', 'm').
sex('Светлана Анисимова', 'f').
sex('Никита Тараканов', 'm').
sex('Кирилл Тараканов', 'm').
sex('Станислав Задонский', 'm').
sex('Татьяна Морозова', 'f').
sex('Алексей Горшелев', 'm').
sex('Елена Горшелева', 'f').
sex('Сергей Кинжалов', 'm').
sex('Полина Кинжалова', 'f').
sex('Фёкла Тверская', 'f').
sex('Павел Пятов', 'm').
sex('Анна Пятова', 'f').
sex('Петр Морозов', 'm').
sex('Анна Ивановская', 'f').
sex('Михаил Анисимов', 'm').
sex('Екатерина Першина', 'f').
sex('Полина Павликова', 'f').
sex('Олег Хомяков', 'm').
sex('Алексей Тараканов', 'm').
sex('Евгения Молчанова', 'f').
sex('Максим Горшелев', 'm').
sex('Анатолий Горшелев', 'm').
sex('Сергей Тверской', 'm').
sex('Ольга Тверская', 'f').
